brew "zsh"
brew "coreutils"

# For programming
brew "vim"
brew "fzf"
brew "ripgrep"
brew "cmake"
brew "git"
brew "gnupg"
brew "imagemagick"
brew "node"
brew "yarn"
cask "electron"

# For backup
brew "borgbackup"
brew "f3"

# For terminal
brew "htop"
brew "tmux"
brew "reattach-to-user-namespace"

# For storage
brew "postgresql"
brew "postgis"
brew "redis"

# Chess
brew "lc0"
brew "stockfish"

# Apps
cask "blender"
cask "caffeine"
cask "discord"
cask "docker"
cask "firefox"
cask "iterm2"
cask "libreoffice"
cask "obs"
cask "postico"
cask "signal"
cask "spotify"
cask "steam"
cask "vlc"
cask "whatsapp"
cask "parallels"
cask "transmission"
cask "the-unarchiver"
cask "android-studio"
cask "messenger"
cask "anaconda"
cask "raspberry-pi-imager"
