brew "ctags"
brew "vim"
brew "ack"
brew "node"
brew "htop"
brew "reattach-to-user-namespace"
brew "cmake"
brew "fzf"

cask "caffeine"
cask "dropbox"
cask "iterm2"
cask "skype"
cask "flux"
cask "firefox"
cask "google-chrome"
cask "harvest"
cask "heroku-toolbelt"
cask "sequel-pro"
cask "steam"
cask "virtualbox"
cask "slack"
cask "transmission"
cask "vlc"
cask "multibit"
