tap "homebrew/cask"
tap "homebrew/services"

brew "zsh"
brew "coreutils"
brew "mas"

# Terminal
brew "vim"
brew "fzf"
brew "ripgrep"
brew "git"
brew "lazygit"
brew "htop"
brew "tmux"
brew "reattach-to-user-namespace"
brew "tree"
brew "jq"
brew "nnn"
brew "viu"
brew "ranger"
brew "entr"
brew "youtube-dl"

# Programming
brew "cmake"
brew "imagemagick"
brew "node"
brew "yarn"
brew "go"
brew "podman"
brew "rust"
brew "typescript"

# For backup
brew "borgbackup"
brew "f3"

# For storage
brew "postgresql"
brew "postgis"
brew "redis"

# Chess
brew "lc0"
brew "stockfish"

# Apps
cask "anaconda"
cask "android-studio"
cask "autodesk-fusion360"
cask "blender"
cask "caffeine"
cask "cyberduck"
cask "darktable"
cask "discord"
cask "docker"
cask "firefox"
cask "iterm2"
cask "libreoffice"
cask "lulu"
cask "messenger"
cask "obs"
cask "openscad"
cask "parallels"
cask "postico"
cask "prusaslicer"
cask "raspberry-pi-imager"
cask "signal"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "transmission"
cask "twitch"
cask "ultimaker-cura"
cask "vlc"
cask "whatsapp"

mas "Microsoft To Do", id: 1274495053
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "Pages", id: 409201541
