cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "viktomas/taps"
tap "cirruslabs/cli"
tap "buo/cask-upgrade"
tap "homebrew/cask-versions"
tap "enarx/enarx"

brew "enarx"

tap "clintmod/formulas"

brew "clintmod/formulas/macprefs"

brew "zsh"
brew "coreutils"

# Terminal
brew "vim"
brew "neovim"
brew "fzf"
brew "ripgrep"
brew "git"
brew "git-lfs"
brew "lazygit"
brew "htop"
brew "tmux"
brew "reattach-to-user-namespace"
brew "tree"
brew "jq"
brew "nnn"
brew "viu"
brew "ranger"
brew "entr"
brew "youtube-dl"
brew "curl"
brew "wget"
brew "nmap"
brew "mtr"
brew "kind"
brew "telnet"
brew "sox"
brew "create-dmg"
brew "gpg"

# Virtualizing
brew "lima"

# IOT
brew "cmake"
brew "ninja"
brew "gperf"
brew "python3"
brew "ccache"
brew "qemu"
brew "dtc"

brew "bash"
brew "coreutils"
brew "grep"
brew "jq"
brew "python@3.10"
brew "cdrtools"
brew "gnu-sed"
brew "spice-gtk"
brew "wget"
brew "zsync"

# Programming
brew "cmake"
brew "imagemagick"
brew "node"
brew "yarn"
brew "go"
brew "rust"
brew "typescript"
brew "python@3.8"
brew "packer"
brew "act"
brew "hub"
brew "wasm3"
cask "mqtt-explorer"
brew "tart"
brew "softnet"
brew "r"

# Compiling blender
brew "svn"

# For backup
brew "restic"
brew "f3"

# For storage
brew "postgresql@14"
brew "postgis"
brew "redis"

# Chess
brew "lc0"
brew "stockfish"

# Network
brew "iperf"
brew "qrencode"
brew "wireshark"
brew "ntopng"

# Sound
brew "gnuradio"

# Stable diffusion
brew "cmake"
brew "protobuf"
brew "rust"
brew "python"
brew "git"
brew "wget"

# Servo
brew "rustup"
brew "gnutls"
brew "gstreamer"
brew "gst-plugins-base"
brew "gst-libav"
brew "gst-plugins-bad"
brew "gst-plugins-good"
brew "gst-rtsp-server"
brew "openssl"
brew "autoconf@2.13"
brew "automake"
brew "cmake"
brew "pkg-config"
brew "llvm"
brew "yasm"
brew "zlib"
brew "openssl@1.1"

# Apps
cask "arduino-ide"
cask "adium"
cask "anaconda"
cask "miniconda"
cask "android-studio"
cask "blender"
cask "caffeine"
cask "cyberduck"
cask "darktable"
cask "deezer"
cask "discord"
cask "figma"
cask "firefox"
cask "freecad"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "libreoffice"
cask "lockdown"
cask "lulu"
cask "messenger"
cask "obs"
cask "openscad"
cask "openscad"
cask "parallels"
cask "postico"
cask "prusaslicer"
cask "rhino"
cask "signal"
cask "steam"
cask "the-unarchiver"
cask "transmission"
cask "ultimaker-cura"
cask "utm"
cask "vagrant"
cask "visual-studio-code"
cask "visual-studio"
cask "vlc"
cask "enfusegui"
cask "hugin"
cask "whatsapp"
cask "raspberry-pi-imager"
cask "android-platform-tools"
cask "pycharm-ce"
cask "brave-browser"
cask "calibre"
cask "balenaetcher"
cask "kindle"
cask "skype"
cask "twitch-studio"
cask "altserver"
# cask "parallels-virtualization-sdk"
cask "epic-games"
cask "hammerspoon"
cask "kicad"
cask "librepcb"
cask "android-file-transfer"
cask "unetbootin"

